In [37]:
import pandas as pd

In [38]:
df=pd.read_excel('CustomerAddress.xlsx')

In [39]:
df.head()

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,customer_id,address,postcode,state,country,property_valuation
1,1.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0
2,2.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0
3,4.0,0 Holy Cross Court,4211.0,QLD,Australia,9.0
4,5.0,17979 Del Mar Point,2448.0,New South Wales,Australia,4.0

In [40]:
df.columns=df.iloc[0]#marking header

In [41]:
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,customer_id,address,postcode,state,country,property_valuation
1,1.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0
2,2.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0
3,4.0,0 Holy Cross Court,4211.0,QLD,Australia,9.0
4,5.0,17979 Del Mar Point,2448.0,New South Wales,Australia,4.0

In [42]:
df.drop(0,axis=0,inplace=True)#removing extra header like row

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3999 entries, 1 to 3999
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   object
 1   address             3999 non-null   object
 2   postcode            3999 non-null   object
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   object
dtypes: object(6)
memory usage: 218.7+ KB

In [44]:
df['property_valuation']=df['property_valuation'].astype('float')#changing datatype to numeric

In [45]:
df.shape

(3999, 6)

In [46]:
df.describe()

0      property_valuation
count         3999.000000
mean             7.514379
std              2.824663
min              1.000000
25%              6.000000
50%              8.000000
75%             10.000000
max             12.000000

In [47]:
df.duplicated().sum()

0

In [48]:
df.describe(include='object')

0       customer_id                  address  postcode state    country
count        3999.0                     3999    3999.0  3999       3999
unique       3999.0                     3996     873.0     5          1
top             1.0  3 Mariners Cove Terrace    2170.0   NSW  Australia
freq            1.0                        2      31.0  2054       3999

In [49]:
df['country'].unique()

array(['Australia'], dtype=object)

In [50]:
df['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [51]:
df['state']=df['state'].map({'New South Wales':'NSW','Victoria':'VIC','NSW':'NSW','VIC':'VIC','QLD':'QLD'})

In [52]:
df['state'].unique()

array(['NSW', 'QLD', 'VIC'], dtype=object)

In [53]:
df['address'].tail(60)

3940            81 Monument Avenue
3941              093 Mallard Hill
3942            903 Sauthoff Plaza
3943             9796 Pearson Hill
3944             950 Algoma Circle
3945               28 Toban Center
3946       147 Brickson Park Drive
3947          75251 Marquette Lane
3948           72 Briar Crest Hill
3949          201 Valley Edge Park
3950            6031 Susan Terrace
3951                  724 Erie Way
3952              86906 Hauk Trail
3953         85999 Cherokee Street
3954             50774 Dennis Park
3955            64 Trailsway Place
3956            95228 Forster Road
3957            388 Shoshone Trail
3958    67 Lakewood Gardens Circle
3959            98 Transport Plaza
3960                35 Larry Plaza
3961               9 Hooker Street
3962                  4 Debra Hill
3963          41 Superior Crossing
3964              721 Morrow Plaza
3965             8578 Mifflin Pass
3966             02 Fair Oaks Lane
3967               910 Becker Pass
3968            08 Dennis Crossing
3969               4 Express Plaza
3970          81609 Vernon Terrace
3971               37 Hintze Court
3972              07 Morning Court
3973           327 Loeprich Street
3974         5106 Northridge Drive
3975    9754 High Crossing Terrace
3976           7 Meadow Vale Court
3977            80260 Morning Road
3978       38017 Briar Crest Drive
3979         60 Morningstar Center
3980           218 Stuart Junction
3981            9 Butterfield Lane
3982          614 Burning Wood Way
3983                9 Grover Point
3984              565 Bunting Park
3985         9461 Saint Paul Trail
3986            5204 Delaware Pass
3987                 24 Scott Pass
3988               8 Randy Parkway
3989             681 Elmside Place
3990        2918 Summer Ridge Hill
3991                 613 Erie Lane
3992            0 Transport Center
3993           4 Dovetail Crossing
3994          736 Roxbury Junction
3995               1482 Hauk Trail
3996     57042 Village Green Point
3997        87 Crescent Oaks Alley
3998              8194 Lien Street
3999               320 Acker Drive
Name: address, dtype: object